Tekla Open API Reference for Tekla Structures 2025
TaskDependency.DependencyType Property
 The type of the task dependency.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TaskDependency.DependencyTypeEnum DependencyType { get; set; }
Public Property DependencyType As TaskDependency.DependencyTypeEnum
	Get
	Set
Property Value
Type: TaskDependency.DependencyTypeEnum
See Also
Reference
TaskDependency Class
Tekla.Structures.Model Namespace